run/papers/consistentFSI/cirleInCircle/fsiBody3MeshUn4_BDF3_rel0.99-n2/base/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object controlDict;
}

libs      (
      "libmySchemes.so" "libmyBoundaries.so"
    )
application pimpleFoamRC ;

startFrom startTime;

startTime 0.0;

stopAt endTime;

endTime 0.2;

deltaT 0.02;

writeControl timeStep;

writeInterval 1;

purgeWrite 0;

writeFormat ascii;

writePrecision 12;

writeCompression uncompressed;

timeFormat general;

timePrecision 6;

graphFormat raw;

runTimeModifiable no;
adjustTimeStep no;
maxCo 0.5;

maxDeltaT 0.25; 	// ************************************************************************* //
