run/papers/consistentFSI/cirleInCircle/fsiBody3MeshUn4_BDF3_rel0.99-n2/base/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-11;
        relTol           0.005;
		minIter			 1;
    };

    U
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-11;
        relTol           0.005;
		minIter			 1;
    };
}

PIMPLE
{
    checkMeshCourantNo true;
    momentumPredictor yes;

    nOuterCorrectors 200;
    nCorrectors     10;
    nNonOrthogonalCorrectors 1;

    pRefCell		0;
    pRefValue       0;

    outerConvergence 1e-9;
    innerConvergence 0;
}

relaxationFactors
{
    p 0.99;
    U 0.99;
}


// ************************************************************************* //
